# ***************************************************************************************
# Library   : timetk
# Function  : lag_vec
# Created on: 2021/8/14
# URL       : https://business-science.github.io/timetk/reference/lag_vec.html
# ***************************************************************************************


# ＜概要＞
# - ラグ系列/リード系列の作成
#   --- 関数名ではなくlag引数でコントロールしている（lag_vec()を使うことで統一）


# ＜構文＞
# lag_vec(x, lag = 1)
# lead_vec(x, lag = -1)


# ＜目次＞
# 0 準備
# 1 ベクトル操作
# 2 データフレーム操作


# 0 準備 ---------------------------------------------------------------------

# ライブラリ
library(dplyr)
library(timetk)


# データ準備
d10_daily <- m4_daily %>% filter(id == "D10")

# データ確認
d10_daily %>% print()
d10_daily %>% glimpse()


# 1 ベクトル操作 -------------------------------------------------------------

# 元データ
1:10

# ラグ系列
1:10 %>% lag_vec(lag = 1)
1:10 %>% lead_vec(lag = 1)

# リード系列
1:10 %>% lag_vec(lag = -1)
1:10 %>% lead_vec(lag = -1)


# 2 データフレーム操作 ---------------------------------------------------------

# ラグ系列の追加
m4_daily %>%
  group_by(id) %>%
  mutate(lag_1 = lag_vec(value, lag = 1))
